Repository: 84000/data-translation-memory
Catalog: toh165-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བདེ་བྱེད་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Question of Kṣemaṅkara

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱའི་ཡུལ་སེར་སྐྱའི་གནས་ན། ཤཱཀྱ་རྣམས་ཀྱི་ཤིང་ནྱ་གྲོ་དྷའི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་ལྔ་བརྒྱའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was staying in the Nyagrodha Park of the Śākyas, near Kapilavastu in the Śākya country, together with a great saṅgha of five hundred monks.

source: །དེའི་ཚེ་ཤཱཀྱའི་བུ་བདེ་བྱེད་ཅེས་བྱ་བ་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་སྟེ། ཤིང་ནྱ་གྲོ་དྷའི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time a Śākya youth named Kṣemaṅkara set out from the city of Kapilavastu for Nyagrodha Park, where the Blessed One was staying.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །དེ་ནས་ཤཱཀྱའི་བུ་བདེ་བྱེད་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: As soon as he arrived there, he touched his head to the feet of the Blessed One and sat down to one side.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར། ཚེགས་ཆུང་ངུས་ཀྱང་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་མངོན་པར་སྒྲུབ་པར་བགྱིད། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མཆི་བར་བགྱིད། རྨོངས་པ་མ་མཆིས་པར་འགུམ་པའི་དུས་བགྱིད་པར་འགྱུར། སྐྱེས་ནས་ཀྱང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་འགྱུར། མི་ཁོམ་པ་ཐམས་ཅད་རྣམ་པར་སྤངས་ཤིང་ཁོམ་པ་འབྱོར་པ་ཐོབ་པར་འགྱུར། གཟུངས་ཀྱང་ཐོབ་པར་འགྱུར། སྤོབས་པ་ཐོགས་པ་མ་མཆིས་པ་དང་ཡང་ལྡན་པར་འགྱུར། ཕྱིར་མི་ལྡོག་པའི་ཆོས་དང་ལྡན་ཞིང་སྟོང་པ་ཉིད་ལ་ལྷག་པར་མོས་པར་ཡང་འགྱུར། རྟག་ཏུ་རབ་ཏུ་འབྱུང་བ་ལ་མངོན་པར་དགའ་བར་འགྱུར། ཁྱིམ་ན་གནས་ཀྱང་རྟག་ཏུ་ཚངས་པར་སྤྱོད་པ་ལ་མངོན་པར་དགའ་བར་འགྱུར་ལགས།
en: With folded palms the Śākya youth Kṣemaṅkara bowed down to the Blessed One and asked him, “Blessed One, what attributes should bodhisattvas possess in order to progress irreversibly toward unsurpassed and perfect awakening, so that even with just a little effort they will obtain the thirty-two marks of a great being, proceed from buddha realm to buddha realm, pass away free from delusion, possess the five types of superknowledge as soon as they are born, discard all unfree states, obtain leisure and advantages, gain retention, possess unobstructed eloquence, possess the quality of not regressing, gain interest in emptiness, always delight in going forth, and always delight in pure conduct, even when staying in a household?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཤཱཀྱའི་བུ་གཞོན་ནུ་བདེ་བྱེད་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི་རིགས་ཀྱི་བུ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དོན་དང་། ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་ཏེ།
en: In answer to this question, the Blessed One replied to the young Śākya Kṣemaṅkara, “Noble son, you have asked the Thus-Gone One about this topic for the sake of benefiting and bringing happiness to a multitude of beings, out of love for the world, for the welfare of numerous people, and in order to benefit and bring happiness to gods and humans.

source: ལེགས་སོ་ལེགས་སོ།
en: Excellent, excellent!

source: །དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Therefore, noble son, listen carefully and keep the following in mind, as I shall now explain.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་དེ་དག་རྗེས་སུ་འཐོབ་སྟེ།
en: “Bodhisattvas who possess four attributes will attain the qualities you have described.

source: བཞི་གང་ཞེ་ན།
en: What are those four attributes?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པའི་སྟོབས་དང་ལྡན་ཞིང་བཟོད་པ་ལ་གནས་པ་དེ་ཕ་རོལ་གཤེ་ཡང་སླར་མི་གཤེ་བ་དང་། བརྡེགས་ཀྱང་སླར་མི་རྡེག་པ་དང་། མཚང་བྲུས་ཀྱང་སླར་མཚང་མི་འདྲུ་བ་དང་། ཁྲོས་ཀྱང་སླར་མི་ཁྲོ་བ་སྟེ།
en: Noble son, they are as follows: bodhisattvas who possess the strength of patience and practice patience (1) do not retaliate though others revile them, (2) do not strike back though others beat them, (3) do not quarrel though others quarrel with them, and (4) do not get angry though others are hostile to them.

source: རིགས་ཀྱི་བུ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ཇི་སྐད་སྨྲས་པའི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཡང་རྗེས་སུ་འཐོབ་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ།
en: Noble son, bodhisattvas who possess those four attributes will progress irreversibly toward unsurpassed and perfect awakening and will obtain the perfect qualities you have described.”

source: བདེ་བར་གཤེགས་པས་དེ་སྐད་གསུངས་ནས་དེ་བཞིན་དུ་སྟོན་པས་གཞན་ཡང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: When the Blissful One had said this, the Teacher also spoke these words:

source: །ཀུན་ཏུ་སྤྱོས་ཀྱང་གཤེ་བར་མི་བྱེད་ལ།
en: “Although blamed, do not reciprocate.

source: །གནོད་བྱས་གཞན་ལ་དེ་ནི་གནོད་མི་བྱེད།
en: Having been harmed, do not harm others.

source: །དེ་ནི་མི་ལུས་སྤང་བ་བྱས་ནས་ཀྱང་།
en: Even if it means giving up their human bodies,

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་དེ་དག་འཐོབ།
en: Bodhisattvas will attain these qualities.

source: །སྡིག་པའི་ཚིག་རྣམས་རྟག་ཏུ་སྲུང་བྱེད་ཅིང་།
en: “Always guard against evil words,

source: །སྡིག་པའི་སེམས་ཀྱི་དབང་དུ་མི་འགྲོ་ལ།
en: And do not be controlled by a negative mind.

source: །སྡིག་ལས་ལོག་སྟེ་འབྲས་བུ་དེ་ཐོབ་ནས།
en: Eliminate misdeeds, and you will gain such results

source: །ཡེ་ཤེས་མཆོག་ཉིད་མྱུར་དུ་ཐོབ་པར་འགྱུར།
en: And quickly achieve supreme wisdom.

source: །སྐྱེ་བོ་གང་དག་འཚོག་རུང་དགའ་བྱེད་ཅིང་།
en: “Some people take pleasure in striking others,

source: །ཁྲོ་གཏུམ་གནོད་པར་སེམས་པའི་སེམས་ལྡན་རྣམས།
en: And have a ruthless and malicious attitude.

source: །སངས་རྒྱས་ཡེ་ཤེས་ཡོངས་སུ་སྤངས་ནས་སུ།
en: Having forsaken the wisdom of the buddhas,

source: །མི་མཁས་དེ་དག་སྡུག་བསྔལ་མི་བཟད་ལྡན།
en: Such unwise people will be burdened with unbearable suffering.

source: །དེ་ལྟ་བས་ན་གཞན་ལ་མི་འཚོག་ཅིང་།
en: “Therefore, do not beat others,

source: །རྒྱུ་དང་མི་རྒྱུ་རྣམས་ལ་དབྱུག་པ་སྤངས།
en: And abstain from striking anything, animate or inanimate.

source: །སེམས་ཅན་ཀུན་ལ་ཕན་ཞིང་སྙིང་བརྩེར་ལྡན།
en: Benefiting all beings with love and affection,

source: །དེས་འདིར་ཡེ་ཤེས་དམ་པ་མྱུར་དུ་འཐོབ།
en: You will quickly attain supreme wisdom.

source: །སྐྱེ་བོ་རྨོངས་པ་ཁྲོས་པས་ཟིལ་ནོན་པ།
en: “Deluded beings overwhelmed by anger

source: །འཇིག་རྟེན་མཁས་པའི་བསྟན་ལས་དེ་རིང་སྟེ།
en: Are far from the teaching of those who are wise in this world.

source: །དེ་ནི་ལོག་ལྟ་རྣམས་ཀྱིས་ངན་འཛིན་ཡིན།
en: Because of wrong views, they are bent on negative ways.

source: །དེ་ལྟ་བས་ན་མཁས་མིས་དཀྲུག་མི་བྱ།
en: Therefore, wise people should not disturb them.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་འདིར་མི་ཁྲོ་ཞིང་།
en: “Bodhisattvas should not get angry,

source: །བདེན་པ་རྗེས་སྲུང་གཞན་ལ་མི་གནོད་པ།
en: But guard the truth without harming others.

source: །སྤྱད་པ་དཀོན་པ་འདི་དག་རྫོགས་བྱས་ནས།
en: Perfecting these rare actions,

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་མཛེས་ཕུན་སུམ་ཚོགས།
en: They will possess all the exquisite thirty-two marks.

source: །མི་མཁས་རྟག་ཏུ་ཕུང་ཞིང་སྡང་སེམས་ལྡན།
en: “The unwise always have a destructive and hostile attitude;

source: །ཕ་མ་ལ་ཡང་འདི་ན་གུས་མི་བྱེད།
en: They do not even respect their own parents.

source: །ཀུན་ནས་ཉོན་མོངས་རྩ་བ་རབ་གནས་པ།
en: They are enmeshed in the roots of affliction,

source: །སྐྱེས་བུ་ཐ་མའི་ཉེས་པ་འདི་རྣམས་ཡིན།
en: Which are the flaws of the lowest type of person.

source: །དེ་བས་རྟག་ཏུ་བཟོད་པ་ཁོ་ན་བསྟེན།
en: “Therefore, always rely wholly on patience,

source: །དགེ་སློང་ཆོས་སྨྲ་བ་ལ་བསྟེན་པར་བྱ།
en: Attend to monks who teach the Dharma,

source: །དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་མི་གཏོང་སྟེ།
en: And never forsake spiritual friends.

source: །དེ་ལ་བྱང་ཆུབ་མཆོག་ནི་དཀའ་བ་མེད།
en: Then supreme awakening will be easy.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཡང་རྗེས་སུ་འཐོབ་བོ།
en: “Noble son, bodhisattvas who possess four additional attributes will progress irreversibly toward unsurpassed and perfect awakening, and they will achieve the perfect qualities you have described.

source: །བཞི་གང་ཞེ་ན།
en: What are those four attributes?

source: རིགས་ཀྱི་བུ་འདི་ལ་ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་འདོད་པ་དང་། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པ་དང་། ཆོས་འཛིན་པ་དང་། ཆོས་སྟོན་པ་ཡིན།
en: Noble son, they are (1) pursuing the Dharma, yearning for the Dharma, and rejoicing, delighting in, and being inspired by the Dharma, as well as holding the Dharma and teaching the Dharma;

source: བུད་མེད་ཡོངས་སུ་སྤོང་ཞིང་བུད་མེད་ལ་སྟེན་པར་མི་བྱེད་པ་ཡིན།
en: renouncing women and not indulging in women;

source: སྦྱིན་པའི་བདག་པོ་དང་། ཀུན་བགེད་པའི་ངང་ཚུལ་ཅན་དང་། ཀུན་བགེད་པ་ལ་དགའ་བ་དང་། རྨུགས་པ་དང་། གཉིད་ཡོངས་སུ་སྤོང་བ་ཡིན།
en: rejoicing in benefactors, in their giving nature, and in their giving, as well as renouncing dullness and sleep;

source: སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། སྟོང་པ་ཉིད་ལ་གནས་པ་ཡིན་ཏེ།
en: and (4) feeling inspired by emptiness and abiding in emptiness.

source: རིགས་ཀྱི་བུ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་དེ་དག་ཀྱང་འཐོབ་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ།
en: Noble son, bodhisattvas who possess those four attributes will progress irreversibly toward unsurpassed and perfect awakening and they will achieve the qualities you have described.”

source: །སེམས་ཅན་གང་དག་ཆོས་ནི་འདོད་པ་དང་། །ཆོས་ཀྱི་དོན་དུ་བརྩོན་འགྲུས་བསྐྱེད་པ་དཀོན།
en: “Beings who yearn for the Dharma And generate effort for the sake of the Dharma are rare.

source: །གང་དག་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བྱེད་པ།
en: Anyone who makes the wheel of Dharma turn

source: །དེ་དག་ཡེ་ཤེས་དམ་པ་ཐོབ་པར་འགྱུར།
en: Will attain supreme wisdom.

source: །གཞན་ལས་ཐོས་ནས་ཡང་དག་འཛིན་བྱེད་ཅིང་།
en: “Hearing it from others they will genuinely retain it,

source: །ཕ་རོལ་དོན་དུ་གཉེར་ལ་ཆོས་སྟོན་ལ།
en: And then teach the Dharma to others who are interested.

source: །ཤེས་ལྡན་དེ་དག་འཁོར་དུ་ཞུམ་པ་མེད།
en: Such wise ones will not lose courage in a gathering.

source: །བླ་མེད་བྱང་ཆུབ་མཆོག་ལ་རེག་པར་འགྱུར།
en: They will reach unsurpassed and supreme awakening.

source: །ལོག་པར་ལྟུང་རྒྱུ་བུད་མེད་རྣམ་པར་སྤངས།
en: “Rejecting women, the cause of downfalls,

source: །རྒྱལ་སྲས་རྟག་ཏུ་ཚངས་པར་སྤྱོད་པར་འགྱུར།
en: A son of the victors will always practice pure conduct.

source: །ཚངས་པར་སྤྱོད་ལ་བརྟན་པར་དེ་གནས་ཤིང་།
en: Stable in the practice of pure conduct,

source: །འཁོར་ལོ་བླ་མེད་དམ་པ་སྐོར་བར་བྱེད།
en: He will turn the unsurpassed, sacred wheel.

source: །བུད་མེད་རྣམས་ལ་མཚན་མ་འགའ་ཡོད་དེ།
en: “Those who delight in the features of women

source: །འདི་ལྟར་སྡུག་བསྔལ་ཉམ་ཐག་སྐེམ་པར་འགྱུར།
en: Will become miserable, poor, and feeble.

source: །དེ་དག་བསྟེན་ན་ཞི་བ་མེད་པ་སྟེ།
en: Indulging in them will not bring peace,

source: །དེ་བས་ཡོངས་སུ་སྤོངས་ལ་བྱང་ཆུབ་སྤྱོད།
en: So forsake them and engage in bodhisattva conduct.”

source: །དེ་ནས་ཤཱཀྱའི་བུ་བདེ་བྱེད་བསྟན་པ་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: Upon hearing these teachings, the Śākya youth Kṣemaṅkara felt satisfied, delighted, and thrilled.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་རང་གི་ལུས་ལས་རྒྱན་བཀྲོལ་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་གཏོར་ཏོ།
en: Feeling joyful and happy, he unfastened the ornaments on his body and scattered them before the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་རྒྱན་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་དྲང་ཐད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་ཞིག་ཏུ་འདུག་པར་གྱུར་ནས།
en: Through the Blessed One’s power these ornaments now transformed into a mansion made of precious substances, hovering directly above the Blessed One’s crown.

source: རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དེ་ནས་མི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ལྔ་བརྒྱ་བྱུང་ནས།
en: From that mansion emanated five hundred people decorated with all manner of ornaments, who scattered their own ornaments in the direction of the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་རྒྱན་རྣམས་འཐོར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་སེམས་བསྐྱེད་ནས་ཚིག་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་བདག་ཅག་གི་དགེ་བའི་རྩ་བ་འདི་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བགྱིས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ་ཞེས་འཛེར་ཏོ།
en: In addition, they aroused the mind set on unsurpassed and perfect awakening and said, “Blessed One, we are sharing our roots of virtue with all beings, and we dedicate them toward unsurpassed and perfect awakening.”

source: །དེ་ནས་ཤཱཀྱའི་བུ་བདེ་བྱེད་ཀྱིས་ཀྱང་སྤྲུལ་པའི་མི་དེ་དག་མཐོང་ངོ་།
en: The Śākya youth Kṣemaṅkara also perceived these emanated people.

source: །མཐོང་ནས་ཀྱང་ལུས་ཀྱི་སྤུ་ཟིང་ཞེས་བྱེད་པར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་མི་འདི་རྣམས་གང་ནས་མཆིས།
en: Seeing them, the hairs on his body stood on end, so he asked the Blessed One, “Blessed One, where are these people from?

source: ཤར་ཕྱོགས་སམ། ལྷོ་ཕྱོགས་སམ། ནུབ་ཕྱོགས་སམ། བྱང་ཕྱོགས་སམ། འོག་གམ།
en: Are they from the east, from the south, from the west, from the north, from below, or from above?

source: སྟེང་གི་ཕྱོགས་སམ། འོན་ཏེ་ཕྱོགས་མཚམས་གང་ནས་མཆིས།
en: From which cardinal or intermediate direction did they come?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་མི་འདི་རྣམས་ནི་ཤར་ཕྱོགས་ནས་མ་འོངས་ལྷོ་དང་། ནུབ་དང་། བྱང་ཕྱོགས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་དང་། ཕྱོགས་མཚམས་གང་ནས་ཀྱང་མ་འོངས་ཏེ། འདི་རྣམས་ནི་ལྷ་མ་ཡིན། ཀླུ་མ་ཡིན། གནོད་སྦྱིན་མ་ཡིན། དྲི་ཟ་མ་ཡིན།
en: “Noble son,” replied the Blessed One, “these people are from neither the east, south, west, or north;

source: ལྷ་མ་ཡིན་མ་ཡིན། ནམ་མཁའ་ལྡིང་མ་ཡིན།
en: nor from below or above;

source: མིའམ་ཅི་མ་ཡིན། ལྟོ་འཕྱེ་ཆེན་པོ་མ་ཡིན། མི་མ་ཡིན།
en: nor are they from any cardinal or intermediate direction.

source: མི་མ་ཡིན་པ་མ་ཡིན་ནོ། །སའི་ཁམས་ལ་མི་རྟེན། ཆུའི་ཁམས་ལ་མི་རྟེན། མེའི་ཁམས་ལ་མི་རྟེན། རླུང་གི་ཁམས་ལ་མི་རྟེན། ནམ་མཁའི་ཁམས་ལ་མི་རྟེན་ཏོ།
en: They are not gods, they are not nāgas, they are not yakṣas, they are not gandharvas, they are not demigods, they are not garuḍas, they are not kinnaras, they are not mahoragas, they are not humans, and they are not non-humans—they do not abide in the earth element, they do not abide in the water element, they do not abide in the fire element, they do not abide in the wind element, and they do not abide in the space element.

source: །འདི་དག་ལ་ནི་གཟུགས་མེད། ཚོར་བ་མེད། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། སེམས་མེད། ཡིད་མེད། རྣམ་པར་ཤེས་པ་མེད། ལས་མེད། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད། འཇིག་རྟེན་འདི་མེད། འཇིག་རྟེན་ཕ་རོལ་མེད། འོང་བ་མེད། འགྲོ་བ་མེད། གནས་པ་མེད། འཆི་འཕོ་མེད། སྐྱེ་བ་མེད་དོ།
en: They have no form, no feeling, no perception, no formation, no thinking, no mind, no consciousness, no karma, no ripening of karma, no present world, no other world, no coming, no going, no dwelling, no death, and no birth.

source: །འོན་ཀྱང་རིགས་ཀྱི་བུ་འདི་དག་ནི་སྤྲུལ་པ་ཞེས་བྱ་བ་ཡིན་ནོ།
en: However, noble son, they are known as magical emanations.

source: །འདི་དག་ནི་གཞི་མེད་པ་ཞེས་བྱ་བ་ཡིན་ནོ། །འདི་དག་ནི་སྲོག་མེད་པ་ཞེས་བྱ་བ་ཡིན་ནོ། །འདི་དག་ནི་སྐྱེས་བུ་མེད་པ་ཞེས་བྱ་བ་ཡིན་ནོ། །འདི་དག་ནི་གང་ཟག་མེད་པ་ཞེས་བྱ་བ་ཡིན་ནོ། །འདི་དག་ནི་མཚན་ཉིད་མེད་པ་ཞེས་བྱ་བ་ཡིན་ནོ།
en: They are called groundless, they are called lifeless, they are called beingless, they are called personless, they are called characteristicless, they are called void, they are called empty, and they are called essenceless.

source: །འདི་དག་ནི་དབེན་པ་ཞེས་བྱ་བ་ཡིན་ནོ། །འདི་དག་ནི་སྟོང་པ་ཞེས་བྱ་བ་ཡིན་ནོ། །འདི་དག་ནི་ངོ་བོ་ཉིད་མེད་པ་ཞེས་བྱ་བ་ཡིན་ནོ། །བདེ་བྱེད་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་དག་དེ་ལྟར་ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་འདོད་པ་དང་། བཟོད་པ་དང་། ཁོང་དུ་ཆུད་པ་དང་། མངོན་པར་དད་པ་དང་། ཡིད་ཆེས་པ་དང་། གཞན་གྱི་དྲིང་མི་འཇོག་པར་འགྱུར་བའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་བདེ་བྱེད་ངའི་བུ་ཞེས་བྱའོ།
en: “Kṣemaṅkara, those noble sons and daughters who hold all phenomena to be like magical creations—who accept, understand, and have faith and confidence in them as such, and who are not led astray by others—such noble sons and daughters, Kṣemaṅkara, are called my children.

source: །ངའི་རྗེས་སུ་སྐྱེས་པ་ཞེས་བྱའོ། །སྣང་བ་འཛིན་པ་ཞེས་བྱའོ། །འོད་བྱེད་པ་ཞེས་བྱའོ། །མུན་པ་བསལ་བ་ཞེས་བྱའོ། །ཉོན་མོངས་པ་སྤངས་པ་ཞེས་བྱའོ། །སྟོན་པ་ཞེས་བྱའོ། །བསོད་ནམས་ཀྱི་ཞིང་ཞེས་བྱའོ། །ཡོན་ཏན་གྱི་གནས་ཞེས་བྱའོ། །དགེ་སྦྱོང་ཞེས་བྱའོ། །བྲམ་ཟེ་ཞེས་བྱའོ། །ཚོར་བ་པོ་ཞེས་བྱའོ། །གླང་པོ་ཞེས་བྱའོ། །མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: They are known as my descendants, they are known to possess illumination, they are known to be illuminating, they are known to clear away darkness, they are known to abandon afflictions.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ། །སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱའོ། །ཕྱིར་མི་ལྡོག་པའི་ཆོས་དང་ལྡན་པ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་ལྡན་པ་ཞེས་བྱའོ། །ལུང་བསྟན་པ་ཞེས་བྱའོ།
en: They are known as teachers, they are known as fields of merit, they are known as worthy of veneration, they are known as mendicants, they are known as brahmins, they are known as learned, they are known as elephants, they are known as those who accept that phenomena are unborn, they are known as bodhisattvas, they are known as great beings, they are known as having the quality of non-regressing, they are known as having the qualities of bodhisattvas, and they are known as having been prophesied.

source: །རིགས་ཀྱི་བུ་གང་སུ་ཡང་རུང་བ་དག་དེ་ལྟར་ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་མི་འདོད། མི་བཟོད། མི་འཇུག །མི་མོས། མི་དད། ཐོས་ནས་ཀྱང་དངང་ཞིང་སྐྲག་ལ་དངང་བར་འགྱུར་བ་དང་། སླར་ཟློག་པ་དང་། ཕྱིར་གཤེ་བའི་རིགས་ཀྱི་བུ་དེ་དག་ནི་དགེ་སྦྱོང་མ་ཡིན་པ་ཞེས་བྱའོ།
en: “However, noble children who do not agree that all phenomena are like magical creations, and who do not accept this, do not engage with it, have no faith in it, and lack trust in it—who feel frightened and scared upon hearing about it and start to panic, turn away from it, and challenge it—such noble children are known as not being mendicants.

source: །བྲམ་ཟེ་མ་ཡིན་པ་ཞེས་བྱའོ། །མུ་སྟེགས་ཅན་ཞེས་བྱའོ། །དམིགས་པ་ཅན་ཞེས་བྱའོ། །དཀྲུགས་མ་པ་ཞེས་བྱའོ། །སྡིག་པའི་གྲོགས་པོ་ཞེས་བྱའོ། །ཡོངས་སུ་སྤང་བར་བྱ་བ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་ངན་གཡོ་ཅན་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་འཆལ་པ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་ལྟར་བཅོས་པ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སྲེ་ད་ལྟ་བུ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སུན་འབྱིན་པ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་གཏུམ་པ་ཞེས་བྱའོ།
en: They are known as not being brahmins, they are known as non-Buddhists, they are known as those who apprehend things, they are known as depraved, they are known as unwholesome companions, they are known as people to avoid, they are known as deceitful bodhisattvas, they are known as immoral bodhisattvas, they are known as fake bodhisattvas, they are known as worthless bodhisattvas, they are known as corrupted bodhisattvas, and they are known as savage bodhisattvas.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པས་སེམས་ཅན་ཇི་སྙེད་ཅིག་གི་དོན་མཛད།
en: At this point the evil Māra, feeling frustrated and unhappy, went to the location where the Blessed One was staying and asked, “Blessed One, by delivering this Dharma teaching, how many beings’ welfare are you accomplishing?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྡིག་ཅན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: “Evil one,” replied the Blessed One, “through the delivery of this Dharma teaching, eighty-four thousand deities in the realms of desire and form will attain the acceptance that phenomena are unborn.

source: །དགེ་སློང་ལྔ་བརྒྱ་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: The minds of five hundred monks will become free of defilements with no further appropriation.

source: །དགེ་སློང་མ་བདུན་ཅུ་རྩ་ལྔས་ཀྱང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: Seventy-five nuns will also attain the acceptance that phenomena are unborn.

source: །བྱང་ཆུབ་སེམས་དཔའ་བདེ་བྱེད་དང་། དགེ་བསྙེན་ལྔ་བརྒྱ་གཞན་དག་ཀྱང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: The bodhisattva Kṣemaṅkara and five hundred other laymen will also attain the acceptance that phenomena are unborn.

source: །དགེ་བསྙེན་མ་ཉི་ཤུ་རྩ་ལྔ་ཡང་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: Twenty-five female lay practitioners will purify the eye of Dharma, making it free from dust and dirt with regard to all phenomena, and all of them will attain the acceptance that phenomena are unborn.

source: །དེ་དག་ཐམས་ཅད་ཀྱང་འདི་ནས་ཤི་འཕོས་ནས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: When passing away, all of them will be reborn in Sukhāvatī, the buddha realm of the thus-gone, worthy, perfect buddha Amitābha.

source: །དེར་སྐྱེས་ནས་ཐམས་ཅད་ལྷན་ཅིག་འཐུན་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་འཛིན་པར་འགྱུར།
en: Once born there, they will all jointly uphold the awakening of the buddhahood of infinite blessed buddhas.

source: བརྗོད་པར་འགྱུར། སྟོན་པར་འགྱུར། ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་འགྱུར་རོ།
en: They will express it, teach it, and authentically expound it.

source: །དེ་དག་ཕྱིས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པ་འདས་ནས། བསྐལ་པ་བཟང་པོ་ཞེས་བྱ་བ་འདི་ཉིད་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: In the future, after as many eons as there are grains of sand in the Ganges River, during the so-called Good Eon of this trichiliocosm, they will fully awaken to unsurpassed and perfect buddhahood.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ལ་འགྱོད་ཅིང་མཆི་མས་བརྣངས་ལ་ངུ་བཞིན་དུ་གྱུར་ཏེ།
en: The evil Māra felt frustrated and unhappy. With regret, he began to weep.

source: དེ་ཉིད་ནས་ཕྱིར་འགྲོ་ཞིང་ཚིག་འདི་སྐད་དུ། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སླན་ཅད་མི་བཤད་དུ་གསོལ་ཞེས་སྨྲས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: As he was leaving, he said, “Blessed One, please do not deliver this Dharma teaching again!”

source: སྡིག་ཅན་ཁྱོད་དེ་སྐད་མ་སྨྲ་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Evil one, you should not speak like that!” replied the Blessed One. “And why not?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་འདི་ནི་ཐོགས་པ་མེད་པ་ཡིན་ནོ།
en: Because the turning of the Dharma wheel of all the blessed buddhas is unimpeded.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then venerable Ānanda asked the Blessed One, “Blessed One, what is this Dharma teaching called, and how should it be identified?”

source: ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱང་ཆུབ་སེམས་དཔའ་ངེས་པར་འབྱུང་བ་ཞེས་བྱ་བར་ཟུང་ཤིག །བདེ་བྱེད་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །ཀུན་དགའ་བོ་ངས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁྱོད་ལ་གཏད་དེ།
en: The Blessed One responded, “Ānanda, you may call this Dharma discourse The Bodhisattva’s Renunciation , or you should call it The Question of Kṣemaṅkara . Ānanda, I entrust you with this Dharma discourse.

source: གཟུང་བ་དང་། བཀླག་པ་དང་། བཤད་པ་དང་། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་གཏད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: I entrust it to you in order that you retain it, read it aloud, explain it, and accurately teach it to others in great detail.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་གཏོགས་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་དག་ལ་བསྐལ་པ་བཅུར་སྤྱད་པ་བས།
en: Ānanda, noble sons and noble daughters who have genuinely entered the Great Vehicle might practice the five perfections without the perfection of insight for ten eons.
